InsideWCF/Chapter04/HelloWCF/!Messages/SayWith2Params.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:4000/IHelloWCFContract</To>
    <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/IHelloWCFContract/SayWith2Params</Action>
  </s:Header>
  <s:Body>
    <SayWith2Params xmlns="http://tempuri.org/">
      <Input1>Hello</Input1>
      <Input2>World</Input2>
    </SayWith2Params>
  </s:Body>
</s:Envelope>